app/controllers/cars_controller.rb

UPDATE "cars" SET "updated_at" = ?, "avatar" = ? WHERE "cars"."id" = ?  [["updated_at", "2021-10-15 02:59:53.001768"], ["avatar", "re-main.jpg"], ["id", 20]]
---
  def update
    @car = Car.update(car_new_update)

INSERT INTO "cars" ("modelo", "placa", "color", "created_at", "updated_at", "avatar") VALUES (?, ?, ?, ?, ?, ?)  [["modelo", 2034], ["placa", "ASD-123"], ["color", "MARRON"], ["created_at", "2021-10-15 02:53:15.841384"], ["updated_at", "2021-10-15 02:53:15.841384"], ["avatar", "re-main.jpg"]]
---
  def create
    @car = Car.new(car_params)
    if @car.save

DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 14]]
---
  def destroy
    @car = Car.destroy(params[:id])